In [1]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
sns.set()
import warnings
warnings.filterwarnings("ignore")

In [2]:
dataset=pd.read_csv("E-com_Data.csv")
dataset.head()

,CustomerID,Item Code,InvoieNo,Date of purchase,Quantity,Time,price per Unit,Price,Shipping Location,Cancelled_status,Reason of return,Sold as set
0,4355.0,15734,398177.0,29-10-2017,6.0,3:36:00 PM,321.0,1926.0,Location 1,NaN,NaN,NaN
1,4352.0,14616,394422.0,05-10-2017,2.0,2:53:00 PM,870.0,1740.0,Location 1,NaN,NaN,NaN
2,4352.0,14614,394422.0,12-10-2017,2.0,2:53:00 PM,933.0,1866.0,Location 1,NaN,NaN,NaN
3,4352.0,85014B,388633.0,22-08-2017,3.0,2:47:00 PM,623.0,1869.0,Location 1,NaN,NaN,NaN
4,4352.0,15364,394422.0,10-10-2017,2.0,2:53:00 PM,944.0,1888.0,Location 1,NaN,NaN,NaN

In [3]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541116 entries, 0 to 541115
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   CustomerID         404189 non-null  float64
 1   Item Code          537979 non-null  object
 2   InvoieNo           537979 non-null  float64
 3   Date of purchase   537979 non-null  object
 4   Quantity           537979 non-null  float64
 5   Time               537979 non-null  object
 6   price per Unit     537979 non-null  float64
 7   Price              537979 non-null  float64
 8   Shipping Location  537979 non-null  object
 9   Cancelled_status   8345 non-null    object
 10  Reason of return   3 non-null       object
 11  Sold as set        0 non-null       float64
dtypes: float64(6), object(6)
memory usage: 49.5+ MB

In [4]:
dataset.shape

(541116, 12)

In [5]:
dataset.columns

Index(['CustomerID', 'Item Code', 'InvoieNo', 'Date of purchase', 'Quantity',
       'Time', 'price per Unit', 'Price', 'Shipping Location',
       'Cancelled_status', 'Reason of return', 'Sold as set'],
      dtype='object')

In [6]:
dataset=dataset[["CustomerID","InvoieNo","Date of purchase","Price"]]
dataset.head()

   CustomerID  InvoieNo Date of purchase   Price
0      4355.0  398177.0       29-10-2017  1926.0
1      4352.0  394422.0       05-10-2017  1740.0
2      4352.0  394422.0       12-10-2017  1866.0
3      4352.0  388633.0       22-08-2017  1869.0
4      4352.0  394422.0       10-10-2017  1888.0

In [7]:
dataset.duplicated().sum()

6008

In [8]:
dataset.loc[dataset.duplicated(),:]

        CustomerID  InvoieNo Date of purchase   Price
7959        3670.0  375541.0       27-04-2017   804.0
12635        901.0  404814.0       03-12-2017  1395.0
13807        278.0  363157.0       14-12-2016  2028.0
18415       3482.0  400666.0       13-11-2017   566.0
22072          NaN  389820.0       06-09-2017   326.0
...            ...       ...              ...     ...
541111         NaN       NaN              NaN     NaN
541112         NaN       NaN              NaN     NaN
541113         NaN       NaN              NaN     NaN
541114         NaN       NaN              NaN     NaN
541115         NaN       NaN              NaN     NaN

[6008 rows x 4 columns]

In [9]:
dataset=dataset.drop_duplicates(ignore_index=True)

In [10]:
dataset.isnull().sum()/len(dataset)*100

CustomerID          24.714450
InvoieNo             0.000187
Date of purchase     0.000187
Price                0.000187
dtype: float64

In [11]:
dataset=dataset.dropna(subset=["CustomerID"])

In [12]:
dataset.isnull().sum()/len(dataset)*100

CustomerID          0.0
InvoieNo            0.0
Date of purchase    0.0
Price               0.0
dtype: float64

In [13]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 402859 entries, 0 to 535079
Data columns (total 4 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   CustomerID        402859 non-null  float64
 1   InvoieNo          402859 non-null  float64
 2   Date of purchase  402859 non-null  object
 3   Price             402859 non-null  float64
dtypes: float64(3), object(1)
memory usage: 15.4+ MB

In [14]:
dataset=dataset.rename(columns={"InvoieNo":"InvoiceNo","Date of purchase":"Date"})

In [15]:
dataset.head(2)

   CustomerID  InvoiceNo        Date   Price
0      4355.0   398177.0  29-10-2017  1926.0
1      4352.0   394422.0  05-10-2017  1740.0

In [17]:
#date from object type to datetime

dataset["Date"]=pd.to_datetime(dataset["Date"])

In [18]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 402859 entries, 0 to 535079
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   CustomerID  402859 non-null  float64
 1   InvoiceNo   402859 non-null  float64
 2   Date        402859 non-null  datetime64[ns]
 3   Price       402859 non-null  float64
dtypes: datetime64[ns](1), float64(3)
memory usage: 15.4 MB

In [19]:
dataset["CustomerID"].nunique()

4349

In [20]:
dataset["Date"].describe()

count                  402859
unique                    381
top       2017-11-24 00:00:00
freq                     2507
first     2016-02-12 00:00:00
last      2017-12-19 00:00:00
Name: Date, dtype: object

In [22]:
import datetime as dt

In [23]:
dataset["Date"].dt.day

0         29
1         10
2         10
3         22
4         10
          ..
535075    28
535076    27
535077    21
535078    21
535079    17
Name: Date, Length: 402859, dtype: int64

In [24]:
dataset["Date"].dt.month

0         10
1          5
2         12
3          8
4         10
          ..
535075    11
535076    11
535077    12
535078    12
535079    12
Name: Date, Length: 402859, dtype: int64

In [25]:
dataset["Date"].dt.year

0         2017
1         2017
2         2017
3         2017
4         2017
          ...
535075    2017
535076    2017
535077    2016
535078    2016
535079    2016
Name: Date, Length: 402859, dtype: int64

In [26]:
Latest_date=dt.datetime(2017,12,20)
Latest_date

datetime.datetime(2017, 12, 20, 0, 0)

In [27]:
RFMScore = dataset.groupby('CustomerID').agg({'Date': lambda x: (Latest_date - x.max()).days,
                                            'InvoiceNo': lambda x: x.count(),
                                             'Price' : lambda x:x.sum()})

In [29]:
RFMScore.rename(columns={'Date':'Recency', 'InvoiceNo':'Frequency', 'Price':'Monetory'}, inplace=True)

In [30]:
RFMScore.reset_index()

      CustomerID  Recency  Frequency  Monetory
0            2.0        4        181  550416.0
1            3.0       77         27  257404.0
2            4.0       20         72  176613.0
3            5.0       18         16   41976.0
4            6.0        9         84  151822.0
...          ...      ...        ...       ...
4344      4368.0       17         10   20480.0
4345      4369.0      181          7   10774.0
4346      4370.0       12         13   24962.0
4347      4371.0        4        751  279720.0
4348      4372.0       51         68  256952.0

[4349 rows x 4 columns]

In [31]:
RFMScore.Frequency.describe()

count    4349.000000
mean       92.632559
std       230.742279
min         1.000000
25%        17.000000
50%        42.000000
75%       101.000000
max      7919.000000
Name: Frequency, dtype: float64

In [32]:
RFMScore.Recency.describe()

count    4349.000000
mean       61.445160
std        89.656941
min         1.000000
25%        10.000000
50%        19.000000
75%        73.000000
max       617.000000
Name: Recency, dtype: float64

In [34]:
RFMScore.Monetory.describe()

count    4.349000e+03
mean     2.294939e+05
std      8.556685e+05
min     -5.037200e+04
25%      3.814000e+04
50%      8.363500e+04
75%      2.054440e+05
max      3.547209e+07
Name: Monetory, dtype: float64

In [35]:
#split the data into quantile method
quantiles=RFMScore.quantile(q=[0.25,0.50,0.75])
quantiles=quantiles=quantiles.to_dict()
quantiles

{'Recency': {0.25: 10.0, 0.5: 19.0, 0.75: 73.0},
 'Frequency': {0.25: 17.0, 0.5: 42.0, 0.75: 101.0},
 'Monetory': {0.25: 38140.0, 0.5: 83635.0, 0.75: 205444.0}}

In [36]:
def RecencyScore(x,p,d):  #x=dataset,p=percentile,d=datapoint
    if x<=d[p][0.25]:
        return 1 #1 to 10days
    elif x<=d[p][0.50]:
        return 2  #2 means 11to 18days
    elif x<=d[p][0.75]:
        return 3 #19 to73days
    else:
        return 4

In [ ]:
def RecencyScore(x,p,d):  #x=dataset,p=percentile,d=datapoint
    if x<=d[p][0.25]:
        return 1 #1 to 10days
    elif x<=d[p][0.50]:
        return 2  #2 means 11to 18days
    elif x<=d[p][0.75]:
        return 3 #19 to73days
    else:
        return 4

In [38]:
def FreqMonetryScore(x,p,d):  #x=dataset,p=percentile,d=datapoint
    if x<=d[p][0.25]:
        return 4 #1 to 10days
    elif x<=d[p][0.50]:
        return 3  #2 means 11to 18days
    elif x<=d[p][0.75]:
        return 2 #19 to73days
    else:
        return 1

In [41]:
RFMScore.columns

Index(['Recency', 'Frequency', 'Monetory'], dtype='object')

In [42]:
RFMScore['R'] = RFMScore['Recency'].apply(RecencyScore, args=('Recency',quantiles))
RFMScore['F'] = RFMScore['Frequency'].apply(FreqMonetryScore, args=('Frequency',quantiles))
RFMScore['M'] = RFMScore['Monetory'].apply(FreqMonetryScore, args=('Monetory',quantiles))

In [43]:
RFMScore.reset_index()

      CustomerID  Recency  Frequency  Monetory  R  F  M
0            2.0        4        181  550416.0  4  1  1
1            3.0       77         27  257404.0  1  3  1
2            4.0       20         72  176613.0  2  2  2
3            5.0       18         16   41976.0  3  4  3
4            6.0        9         84  151822.0  4  2  2
...          ...      ...        ...       ... .. .. ..
4344      4368.0       17         10   20480.0  3  4  4
4345      4369.0      181          7   10774.0  1  4  4
4346      4370.0       12         13   24962.0  3  4  4
4347      4371.0        4        751  279720.0  4  1  1
4348      4372.0       51         68  256952.0  2  2  1

[4349 rows x 7 columns]

In [44]:
RFMScore['RFMvalue'] = RFMScore[['R','F','M']].sum(axis=1)
RFMScore['RFMGroup'] = RFMScore.R.map(str) + RFMScore.F.map(str) + RFMScore.M.map(str)
RFMScore.reset_index()

      CustomerID  Recency  Frequency  Monetory  R  F  M  RFMvalue RFMGroup
0            2.0        4        181  550416.0  4  1  1         6      411
1            3.0       77         27  257404.0  1  3  1         5      131
2            4.0       20         72  176613.0  2  2  2         6      222
3            5.0       18         16   41976.0  3  4  3        10      343
4            6.0        9         84  151822.0  4  2  2         8      422
...          ...      ...        ...       ... .. .. ..       ...      ...
4344      4368.0       17         10   20480.0  3  4  4        11      344
4345      4369.0      181          7   10774.0  1  4  4         9      144
4346      4370.0       12         13   24962.0  3  4  4        11      344
4347      4371.0        4        751  279720.0  4  1  1         6      411
4348      4372.0       51         68  256952.0  2  2  1         5      221

[4349 rows x 9 columns]

In [46]:
RFMScore['RFMvalue'].nunique()

10

In [47]:
#reduce clusters

Loyality_Lavel = ['Platinum','Diamond','Gold','Silver']
score_cuts = pd.qcut(RFMScore.RFMvalue, q=4, labels=Loyality_Lavel)
RFMScore['Loyality_Lavel'] = score_cuts.values
RFMScore = RFMScore.reset_index()
RFMScore

,CustomerID,Recency,Frequency,Monetory,R,F,M,RFMvalue,RFMGroup,Loyality_Lavel
0,2.0,4,181,550416.0,4,1,1,6,411,Platinum
1,3.0,77,27,257404.0,1,3,1,5,131,Platinum
2,4.0,20,72,176613.0,2,2,2,6,222,Platinum
3,5.0,18,16,41976.0,3,4,3,10,343,Silver
4,6.0,9,84,151822.0,4,2,2,8,422,Gold
...,...,...,...,...,...,...,...,...,...,...
4344,4368.0,17,10,20480.0,3,4,4,11,344,Silver
4345,4369.0,181,7,10774.0,1,4,4,9,144,Gold
4346,4370.0,12,13,24962.0,3,4,4,11,344,Silver
4347,4371.0,4,751,279720.0,4,1,1,6,411,Platinum
4348,4372.0,51,68,256952.0,2,2,1,5,221,Platinum

In [48]:
RFMScore.to_csv('final_data.csv') #save the folder